product= {
  "brands": [
    {
      "make": "RedStar", // Название бренда или марки производителя техники
      "equipment_types": [ // Массив типов техники, выпускаемых этим брендом
        {
          "type": "Фронтальный погрузчик", // Тип техники
          "models": [ // Массив моделей данного типа техники
            {
              "model": "150", // Название или номер модели техники
              "price": 9999999, // Цена модели
              "technical_specifications": { // Объект с техническими характеристиками модели
                "dimensions": { // Габаритные размеры техники
                  "length": "4700 мм", // Длина техники
                  "width": "1350 мм", // Ширина техники
                  "height": "2340 мм" // Высота техники
                },
                "load_capacity": "800 кг", // Грузоподъемность техники в килограммах
                "engine": { // Данные о двигателе
                  "brand": "QUANCHAI", // Марка двигателя
                  "type": "дизельный", // Тип двигателя
                  "power": "34 кВт" // Мощность двигателя в киловаттах
                },
                "weight": "2450 кг", // Полная масса (вес) техники в килограммах
                "transmission": { // Данные о коробке передач
                  "type": "МКПП", // Тип коробки передач
                  "gears_forward": "3", // Число передач вперед
                  "gears_reverse": "2" // Число передач назад
                },
                "bucket_volume": "0.7 м³", // Объем ковша в кубических метрах
                "max_speed": "25 км/ч", // Максимальная скорость передвижения техники в километрах в час
                "tires": { // Данные о шинах
                  "size": "70.5-16", // Типоразмер шин
                  "tread_pattern": "ёлочка" // Рисунок протектора шин
                },
                "max_lift_height": "3600 мм", // Максимальная высота подъема ковша в миллиметрах
                "max_unloading_height": "3000 мм", // Максимальная высота разгрузки ковша в миллиметрах
                "control_type": "джойстик (3-х контурная гидролиния)", // Тип управления
                "equipment": [ // Массив дополнительных элементов комплектации
                  "вентилятор", // Вентилятор в кабине
                  "тормоза барабанные", // Тип тормозной системы
                  "отопитель" // Отопитель в кабине
                ]
              }
            },

            //-------------------------------------------------------------------------------------------------------------------

            {
              "model": "200", // Название или номер модели техники
              "price": 99999999, // Цена модели
              "technical_specifications": { // Объект с техническими характеристиками модели
                "dimensions": { // Габаритные размеры техники
                  "length": "5200 мм", // Длина техники
                  "width": "1500 мм", // Ширина техники
                  "height": "2500 мм" // Высота техники
                },
                "load_capacity": "1200 кг", // Грузоподъемность техники в килограммах
                "engine": { // Данные о двигателе
                  "brand": "DEUTZ", // Марка двигателя
                  "type": "дизельный", // Тип двигателя
                  "power": "45 кВт" // Мощность двигателя в киловаттах
                },
                "weight": "3200 кг", // Полная масса (вес) техники в килограммах
                "transmission": { // Данные о коробке передач
                  "type": "АКПП", // Тип коробки передач
                  "gears_forward": "4", // Число передач вперед
                  "gears_reverse": "2" // Число передач назад
                },
                "bucket_volume": "1.0 м³", // Объем ковша в кубических метрах
                "max_speed": "30 км/ч", // Максимальная скорость передвижения техники в километрах в час
                "tires": { // Данные о шинах
                  "size": "75-16", // Типоразмер шин
                  "tread_pattern": "шарик" // Рисунок протектора шин
                },
                "max_lift_height": "4000 мм", // Максимальная высота подъема ковша в миллиметрах
                "max_unloading_height": "3200 мм", // Максимальная высота разгрузки ковша в миллиметрах
                "control_type": "джойстик (4-х контурная гидролиния)", // Тип управления
                "equipment": [ // Массив дополнительных элементов комплектации
                  "климат-контроль", // Система климат-контроля в кабине
                  "гидравлический насос", // Гидравлический насос для улучшения работы
                  "звуковая сигнализация" // Звуковая сигнализация для безопасности
                ]
              }
            }
          ]
        }
      ]
    }
  ]
}